#+TITLE: Committing to lunch
#+CREATED: [2021-07-11 Sun 00:48]
#+LAST_MODIFIED: [2021-11-21 Sun 15:21]
#+ROAM_TAGS: cryptography composition
#+OPTIONS: toc:nil
#+OPTIONS: tex:t
#+OPTIONS: _:nil ^:nil p:nil

#+HUGO_BASE_DIR: ./
#+hugo_front_matter_format: yaml
#+HUGO_CUSTOM_FRONT_MATTER: :date (org-to-blog-date (org-global-prop-value "CREATED"))
#+HUGO_CUSTOM_FRONT_MATTER: :hero ./images/hero.jpg
#+HUGO_CUSTOM_FRONT_MATTER: :secret false
#+HUGO_CUSTOM_FRONT_MATTER: :excerpt Solving common problems with commitment schemes

#+begin_src emacs-lisp :exports none
(org-babel-do-load-languages
  'org-babel-load-languages
  '((shell . t)
    (python . t)))
#+end_src

#+RESULTS:

#+BEGIN_SRC emacs-lisp :exports none
  (add-to-list 'org-export-filter-latex-fragment-functions
               'sub-paren-for-dollar-sign)
  (add-to-list 'org-export-filter-headline-functions
               'remove-regexp-curly-braces)
  (add-to-list 'org-export-filter-latex-environment-functions
               'sub-paren-for-dollar-sign)
  (export-to-mdx-on-save)
#+END_SRC

#+RESULTS:
: Enabled mdx on save

Alice and Bob are close friends that have known each other for years. Recently
they decided that they wanted to schedule a weekly Saturday lunch together to
catch up on their lives and shoot the shit. They enjoy their discussions as
well as the food. Sometimes Alice chooses where to eat, sometimes Bob chooses,
and sometimes they just return to their favorite spots. Several weeks go by
and the constant debate they always revisit is where are they going to eat
next. Sometimes both of them want to choose, and sometimes neither of them
wants to choose. Eventually they agreed that in those circumstances, they need
a systematic way to decide where they are going to partake in their next meal.

They both agree on two processes to settle their lunch dilemma. The first
process is applied when each wants to go to a different restaurant. In this
circumstance one of them is randomly chosen to become /the decider/ for that
week. The second process is applied when neither party has a preference on a
set of places. In this circumstance, a random place is chosen (no
decider).

They want the processes to be fair, so sometime during the week, they meet up
in person and either flip a coin to see who becomes /the decider/, or they
roll a die to choose a place from a list. Both of these methods work for
them. Happy with the coin and the die, Alice and Bob enjoy several more weeks
of lunches.

Unfortunately, this doesn't last. Alice and Bob's schedules start to get busy
and they don't get a lot of time to see each other in person during the
week. Therefore they can never find time to meet up to flip a coin or roll a
die. This puts Alice and Bob in a pickle. How will they decide where to go to
lunch if they can't meet up?!

They found it most convenient with their busy schedules to communicate online.
One of them would have to do the flip/roll and tell the other the result. But
this puts both of them in a tough spot. Despite being great friends, they
don't trust each other to be honest when it comes to lunch. One of them could
easily lie without the other knowing. They both agree that they want a way to
ensure the authenticity of a flip/roll when they can't directly see it.

Alice and Bob need a virtual coin/die so when one of them flips/rolls the
other can verify that no cheating took place.

This problem could be solved by trusting a third person to flip/roll for
them. However they avoid this option to eliminate the risk that they would
bribed with an egg-roll.

Overall they need a scheme that satisfies a few requirements

1. If someone cheats, the other one can prove it
2. If there is no cheating, then they can prove that the process was fair
3. Cheating should be hard and therefore disincentivized and unlikely

